test/fixtures/control_fail/0_orig/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.OpenFOAM.com                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0; 

boundaryField
{
    "inlet1_.*"
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    "outlet1_.*"
    {
        type            zeroGradient;
    }
    "walls_.*"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
