test/fixtures/control_fail/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      http://www.tridiagonal.co.in          |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          changePatchTypeDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dictionaryReplacement
{
    boundary
    {
     	"walls_.*"
    	{
        	type            wall;
   	}
	"outlet1_.*"
    	{
        	type            patch;
   	}
	"inlet1_.*"
    	{
        	type            patch;
   	}
   }
}

// ************************************************************************* //
