test/fixtures/control_fail/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.tridiagonal.co.in                   |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains	96;

method			simple;

simpleCoeffs
{
    n               	( 4 6 4 );
    delta           	0.001;
}

hierarchicalCoeffs
{
    n               (4 6 4 );
    delta           0.001;
    order           xyz;
}

metisCoeffs
{
    processorWeights 
    (
       
    );
}

manualCoeffs
{
    dataFile        "";
}

distributed     no;

roots
(
);

// ************************************************************************* //
