test/fixtures/control_fail/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|                  |                                                          |
|   F ield         | FOAM:     The Open Source CFD Toolbox                    |
|   O peration     | Version:  2.1.0                                          |
|   A nd           | Web:      http://www.OpenFOAM.org                        |
|   M anipulation  |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr 
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0.001;
        relTol           0.01;
    };
    p_rgh
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0.001;
        relTol           0.01;
    };
    p_rghFinal 
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        0.001;
        relTol           0.01;
    };
    U PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    k PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    epsilon PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    omega PBiCG
    {
        preconditioner   DILU;
        tolerance        1.0;
        relTol           1.0;
    };
    nuTilda PBiCG
    {
        preconditioner   DILU;
        tolerance        1.0;
        relTol           1.0;
    };
    UFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    kFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    epsilonFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        0.001;
        relTol           0.01;
    };
    omegaFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        1.0;
        relTol           1.0;
    };
    nuTildaFinal PBiCG
    {
        preconditioner   DILU;
        tolerance        1.0;
        relTol           1.0;
    };
}

PIMPLE
{
    momentumPredictor yes;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    nAlphaCorr      1;
    nAlphaSubCycles 4;
    cAlpha          1;
    pdRefCell        0;
    pdRefValue       0.0; // New variable
}


// ************************************************************************* //
